blog.org
#+Title: Cosmoi
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.

#+Options: toc:nil date:t num:nil
#+Options: html-style:nil
#+Options: html-postamble:t

** Distribuciones discretas con mónadas                                                      :post:
:PROPERTIES:
:TITLE: Distribuciones discretas con mónadas
:EXPORT_FILE_NAME: distribucionesmonadas.html
:EXPORT_DATE: <2018-05-25 Fri 18:34>
:END:

*** El modelo
Como parte de una serie de ejemplos sobre uso de mónadas, he escrito
un poco de código para modelar distribuciones discretas usando
mónadas.  Por un lado, usa un [[https://math.dartmouth.edu/archive/m20f11/public_html/RANDOMNESS_LCG.pdf][generador congruencial lineal]] para
generar números aleatorios; y por otro, usa la mónada [[https://wiki.haskell.org/State_Monad][State]] para pasar
una semilla aleatoria de una función a otra que me permita seguir
generado números aleatorios.  Por último, aporta un método que deriva
[[http://www.zvon.org/other/haskell/Outputprelude/Show_c.html][Show]] para probar las distribuciones y dibujar un histograma de
cualquiera de ella.

*** Componiendo distribuciones
Lo más útil de esta idea es el poder generar unas distribuciones a
partir de otras. La primera que intentamos es una uniforme discreta
(un dado de =n= caras) usando una semilla inicial. En el siguiente
código se implementa el generador congruencial.

#+BEGIN_SRC haskell
  dice :: Int -> Distribution Int
  dice n = state (\s -> (s `mod` n + 1, 16807*s `mod` 2147483647))
#+END_SRC

Vemos que funciona como una distribución uniforme.

#+BEGIN_SRC
>>> dice 6

1:	 ################
2:	 ################
3:	 ################
4:	 ################
5:	 ################
6:	 ################
#+END_SRC

Y desde ella generar fácilmente otras usando funciones que
compongan distribuciones. Un ejemplo es usar =(⊕) = liftM2 (+)= para
sumar dados.

#+BEGIN_SRC 
>>> dice 6 ⊕ dice 6

2:	 #####
3:	 ##########
4:	 ###############
5:	 ####################
6:	 ##########################
7:	 ##############################
8:	 #########################
9:	 ####################
10:	 ###############
11:	 ##########
12:	 #####
#+END_SRC

*** Otras distribuciones
Si seguimos componiendo usando la estructura de mónada, podemos crear
otras distribuciones simples como la distribución de *Bernoulli* y la
distribución *binomial*.

#+BEGIN_SRC haskell
  bernoulli :: Double -> Distribution Int
  bernoulli p = do
    sample <- dice 1000000
    if (fromIntegral sample / 1000000.0 < p)
      then return 1
      else return 0

  binomial :: Int -> Double -> Distribution Int
  binomial k p = sum <$> replicateM k (bernoulli p)
#+END_SRC

Lo interesante de este código es que dejamos a la estructura de
mónada encargarse internamente de el paso de la semilla de
aleatoriedad y la construcción de distribuciones complejas
puede hacerse composicionalmente.

