distribucionesmonadas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-24 Mon 10:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Distribuciones discretas con mónadas</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="blog.html">Mario Román</a>
</div>
<div id="navigation">
<a href="about.html">About</a>
<a href="blog.html">Blog</a>
<a href="math.html">Math</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Distribuciones discretas con mónadas</h1>
<div id="outline-container-org05e2e36" class="outline-2">
<h2 id="org05e2e36">El modelo</h2>
<div class="outline-text-2" id="text-org05e2e36">
<p>
Como parte de una serie de ejemplos sobre uso de mónadas, he escrito
un poco de código para modelar distribuciones discretas usando
mónadas.  Por un lado, usa un <a href="https://math.dartmouth.edu/archive/m20f11/public_html/RANDOMNESS_LCG.pdf">generador congruencial lineal</a> para
generar números aleatorios; y por otro, usa la mónada <a href="https://wiki.haskell.org/State_Monad">State</a> para pasar
una semilla aleatoria de una función a otra que me permita seguir
generado números aleatorios.  Por último, aporta un método que deriva
<a href="http://www.zvon.org/other/haskell/Outputprelude/Show_c.html">Show</a> para probar las distribuciones y dibujar un histograma de
cualquiera de ella.
</p>
</div>
</div>

<div id="outline-container-org57cdec5" class="outline-2">
<h2 id="org57cdec5">Componiendo distribuciones</h2>
<div class="outline-text-2" id="text-org57cdec5">
<p>
Lo más útil de esta idea es el poder generar unas distribuciones a
partir de otras. La primera que intentamos es una uniforme discreta
(un dado de <code>n</code> caras) usando una semilla inicial. En el siguiente
código se implementa el generador congruencial.
</p>

<div class="org-src-container">
<pre class="src src-haskell">  dice <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  dice n <span style="color: #7590db;">=</span> state <span style="color: #4f97d7;">(</span><span style="color: #7590db;">\</span>s <span style="color: #7590db;">-&gt;</span> <span style="color: #bc6ec5;">(</span>s <span style="color: #7590db;">`mod`</span> n <span style="color: #7590db;">+</span> 1, 16807<span style="color: #7590db;">*</span>s <span style="color: #7590db;">`mod`</span> 2147483647<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Vemos que funciona como una distribución uniforme.
</p>

<div class="org-src-container">
<pre class="src src-bash">  &gt;&gt;&gt; dice 6
  
  1:     <span style="color: #3E8991; font-style: italic;">################</span>
  2:     <span style="color: #3E8991; font-style: italic;">################</span>
  3:     <span style="color: #3E8991; font-style: italic;">################</span>
  4:     <span style="color: #3E8991; font-style: italic;">################</span>
  5:     <span style="color: #3E8991; font-style: italic;">################</span>
  6:     <span style="color: #3E8991; font-style: italic;">################</span>
</pre>
</div>

<p>
Y desde ella generar fácilmente otras usando funciones que
compongan distribuciones. Un ejemplo es usar <code>(⊕) = liftM2 (+)</code> para
sumar dados.
</p>

<div class="org-src-container">
<pre class="src src-bash">&gt;&gt;&gt; dice 6 &#8853; dice 6

2:       <span style="color: #3E8991; font-style: italic;">#####</span>
3:       <span style="color: #3E8991; font-style: italic;">##########</span>
4:       <span style="color: #3E8991; font-style: italic;">###############</span>
5:       <span style="color: #3E8991; font-style: italic;">####################</span>
6:       <span style="color: #3E8991; font-style: italic;">##########################</span>
7:       <span style="color: #3E8991; font-style: italic;">##############################</span>
8:       <span style="color: #3E8991; font-style: italic;">#########################</span>
9:       <span style="color: #3E8991; font-style: italic;">####################</span>
10:      <span style="color: #3E8991; font-style: italic;">###############</span>
11:      <span style="color: #3E8991; font-style: italic;">##########</span>
12:      <span style="color: #3E8991; font-style: italic;">#####</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b9efa1" class="outline-2">
<h2 id="org8b9efa1">Otras distribuciones</h2>
<div class="outline-text-2" id="text-org8b9efa1">
<p>
Si seguimos componiendo usando la estructura de mónada, podemos crear
otras distribuciones simples como la distribución de <b>Bernoulli</b> y la
distribución <b>binomial</b>.
</p>

<div class="org-src-container">
<pre class="src src-haskell">  bernoulli <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  bernoulli p <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
    sample <span style="color: #7590db;">&lt;-</span> dice 1000000
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span>fromIntegral sample <span style="color: #7590db;">/</span> 1000000.0 <span style="color: #7590db;">&lt;</span> p<span style="color: #4f97d7;">)</span>
      <span style="color: #4f97d7; font-weight: bold;">then</span> return 1
      <span style="color: #4f97d7; font-weight: bold;">else</span> return 0

  binomial <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  binomial k p <span style="color: #7590db;">=</span> sum <span style="color: #7590db;">&lt;$&gt;</span> replicateM k <span style="color: #4f97d7;">(</span>bernoulli p<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Lo interesante de este código es que dejamos a la estructura de
mónada encargarse internamente de el paso de la semilla de
aleatoriedad y la construcción de distribuciones complejas
puede hacerse composicionalmente.
</p>
</div>
</div>
