distribucionesmonadas.html

<div id="outline-container-orgef7a082" class="outline-2">
<h2 id="orgef7a082">El código</h2>
<div class="outline-text-2" id="text-orgef7a082">
<p>
El siguiente código es una primera implementación de este post en
Haskell.
</p>

<div class="org-src-container">
<pre class="src src-haskell">  <span style="color: #bc6ec5;">{-# LANGUAGE FlexibleInstances #-}</span>
  <span style="color: #bc6ec5;">{-# LANGUAGE TypeSynonymInstances #-}</span>
  <span style="color: #3E8991; font-style: italic;">{-</span>
<span style="color: #3E8991; font-style: italic;">  En este archivo vamos a usar m&#243;nadas para definir distribuciones</span>
<span style="color: #3E8991; font-style: italic;">  discretas de probabilidad y aplicar operaciones algebraicas sobre ellas.</span>
<span style="color: #3E8991; font-style: italic;">  -}</span>
  <span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #ce537a; font-weight: bold;">Control.Monad.State</span>
  
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Generaci&#243;n aleatoria</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Para generar n&#250;meros pseudoaleatorios usaremos LCGs. La idea es tener</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">un dado que nos d&#233; una distribuci&#243;n de probabilidad uniforme dada una</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">semilla y nos devuelva el resultado de la tirada y una nueva semilla</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">aleatoria. Buscamos que un dado de seis caras sea, por ejemplo:</span>
  <span style="color: #3E8991; font-style: italic;">--</span>
  <span style="color: #3E8991; font-style: italic;">--   </span><span style="color: #3E8991; font-style: italic;">dice 6 :: Seed -&gt; (Int, Seed)</span>
  <span style="color: #3E8991; font-style: italic;">--</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Si quisi&#233;ramos tirar dos dados, tendr&#237;amos que tomar la semilla resultante</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">del primer lanzamiento y pasarla al segundo; algo as&#237;:</span>
  <span style="color: #3E8991; font-style: italic;">--</span>
  <span style="color: #3E8991; font-style: italic;">--   </span><span style="color: #3E8991; font-style: italic;">let (a,newseed) = dice 6 seed</span>
  <span style="color: #3E8991; font-style: italic;">--   </span><span style="color: #3E8991; font-style: italic;">let (b,_)       = dice 6 newseed</span>
  <span style="color: #3E8991; font-style: italic;">--   </span><span style="color: #3E8991; font-style: italic;">print [a,b]</span>
  <span style="color: #3E8991; font-style: italic;">--</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Pero esto se hace demasiado complejo. La semilla, en el fondo, es un</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">estado, as&#237; que podemos modelarla con la m&#243;nada State. Cada lanzamiento</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">ser&#225; de la forma:</span>
  <span style="color: #3E8991; font-style: italic;">--</span>
  <span style="color: #3E8991; font-style: italic;">--   </span><span style="color: #3E8991; font-style: italic;">State Seed a   ===   Seed -&gt; (a, Seed)</span>
  <span style="color: #3E8991; font-style: italic;">--</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Luego podemos llamar a la distribuci&#243;n: Distribution a = State Seed a, y</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">trabajar con ella usando las funciones normales de m&#243;nadas.</span>
  <span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Seed</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  <span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">State</span> <span style="color: #ce537a; font-weight: bold;">Seed</span>
  
  
  
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Nuestra primera distribuci&#243;n es un dado de "n" lados que usa internamente un</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">generador de n&#250;meros aleatorios.</span>
  dice <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  dice n <span style="color: #7590db;">=</span> state <span style="color: #4f97d7;">(</span><span style="color: #7590db;">\</span>s <span style="color: #7590db;">-&gt;</span> <span style="color: #bc6ec5;">(</span>s <span style="color: #7590db;">`mod`</span> n <span style="color: #7590db;">+</span> 1, 16807<span style="color: #7590db;">*</span>s <span style="color: #7590db;">`mod`</span> 2147483647<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
  
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Una moneda es un dado de dos caras</span>
  coin <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  coin <span style="color: #7590db;">=</span> dice 2
    
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Estas funciones pueden ser llamadas con la m&#243;nada estado, dada una</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">semilla inicial, devuelven el resultado y la nueva semilla:</span>
  <span style="color: #3E8991; font-style: italic;">--</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">&#955;&gt; runState (dice 6) 1</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">(2,16807)</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">&#955;&gt; runState (dice 6) 16807</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">(2,282475249)</span>
  <span style="color: #3E8991; font-style: italic;">--</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">El usar composici&#243;n con m&#243;nadas nos ahorraba controlar los errores</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">en el primer caso, aqu&#237; nos ahorra controlar el cambio de semilla,</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">por ejemplo: para lanzar dos dados y hacer que la semilla se pase</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">internamente.</span>
  twodices' <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  twodices' <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
    a <span style="color: #7590db;">&lt;-</span> dice 6
    b <span style="color: #7590db;">&lt;-</span> dice 6
    return <span style="color: #4f97d7;">(</span>a<span style="color: #7590db;">+</span>b<span style="color: #4f97d7;">)</span>

  <span style="color: #4f97d7;">(</span><span style="color: #7590db;">&#8853;</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  <span style="color: #4f97d7;">(</span><span style="color: #7590db;">&#8853;</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">=</span> liftM2 <span style="color: #4f97d7;">(</span><span style="color: #7590db;">+</span><span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7;">(</span><span style="color: #7590db;">&#8855;</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  <span style="color: #4f97d7;">(</span><span style="color: #7590db;">&#8855;</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">=</span> liftM2 <span style="color: #4f97d7;">(</span><span style="color: #7590db;">*</span><span style="color: #4f97d7;">)</span>
  
  twodices <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  twodices <span style="color: #7590db;">=</span> dice 6 <span style="color: #7590db;">&#8853;</span> dice 6
  
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Igual que hago esto, podr&#237;a hacer:</span>
  <span style="color: #3E8991; font-style: italic;">--</span>
  <span style="color: #3E8991; font-style: italic;">--   </span><span style="color: #3E8991; font-style: italic;">foldr (&#8853;) (return 0) [dice 6,dice 6,dice 6]</span>
  <span style="color: #3E8991; font-style: italic;">--   </span><span style="color: #3E8991; font-style: italic;">foldr (&#8853;) (return 0) (replicate 10 (dice 6))</span>
  <span style="color: #3E8991; font-style: italic;">--</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Que da un resultado que se aproxima a una distribuci&#243;n normal.</span>
  
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Ahora, desde ella, podemos crear otras distribuciones. La distribuci&#243;n de</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">bernoulli ser&#237;a la de una moneda trucada donde una cara tiene probabilidad</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">p y la otra tiene probabilidad (1-p).</span>
  bernoulli <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  bernoulli p <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
    sample <span style="color: #7590db;">&lt;-</span> dice 1000000
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span>fromIntegral sample <span style="color: #7590db;">/</span> 1000000.0 <span style="color: #7590db;">&lt;</span> p<span style="color: #4f97d7;">)</span>
      <span style="color: #4f97d7; font-weight: bold;">then</span> return 1
      <span style="color: #4f97d7; font-weight: bold;">else</span> return 0

  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">La distribuci&#243;n binomial es la suma de k distribuciones de Bernoulli</span>
  binomial <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  binomial k p <span style="color: #7590db;">=</span> sum <span style="color: #7590db;">&lt;$&gt;</span> replicateM k <span style="color: #4f97d7;">(</span>bernoulli p<span style="color: #4f97d7;">)</span>
  
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">La distribuci&#243;n constante y otra forma de escribir la distribuci&#243;n</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">binomial, de manera algebraica.</span>
  constant <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  constant n <span style="color: #7590db;">=</span> return n
  
  binomial' <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  binomial' k p <span style="color: #7590db;">=</span> foldr <span style="color: #4f97d7;">(</span><span style="color: #7590db;">&#8853;</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span>constant 0<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span>replicate k <span style="color: #bc6ec5;">(</span>bernoulli p<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
  
  
  
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Muestra la distribuci&#243;n. Los detalles de implementaci&#243;n no son interesantes.</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">Hemos usado  TypeSynonymInstances para simplificar el proceso de sobrecargar</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">la instancia de Show y poder dibujar directamente por la pantalla las</span>
  <span style="color: #3E8991; font-style: italic;">-- </span><span style="color: #3E8991; font-style: italic;">demostraciones.</span>
  <span style="color: #4f97d7; font-weight: bold;">instance</span> <span style="color: #ce537a; font-weight: bold;">Show</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">State</span> <span style="color: #ce537a; font-weight: bold;">Seed</span> <span style="color: #ce537a; font-weight: bold;">Int</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">where</span>
    show <span style="color: #7590db;">=</span> showdist
  
  showdist <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Distribution</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">String</span>
  showdist dist <span style="color: #7590db;">=</span> unlines <span style="color: #7590db;">$</span> map counter <span style="color: #4f97d7;">[</span>minimum samples<span style="color: #7590db;">..</span>maximum samples<span style="color: #4f97d7;">]</span>
    <span style="color: #4f97d7; font-weight: bold;">where</span> samples <span style="color: #7590db;">=</span> fst <span style="color: #7590db;">$</span> runState <span style="color: #4f97d7;">(</span>replicateM 50000 dist<span style="color: #4f97d7;">)</span> 1
          counter n <span style="color: #7590db;">=</span> show n <span style="color: #7590db;">++</span> <span style="color: #2d9574;">":\t "</span> <span style="color: #7590db;">++</span> replicate <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>count n samples<span style="color: #bc6ec5;">)</span> <span style="color: #7590db;">`div`</span> <span style="color: #bc6ec5;">(</span>3000 <span style="color: #7590db;">`div`</span> range<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2d9574;">'#'</span>
          range <span style="color: #7590db;">=</span> maximum samples <span style="color: #7590db;">-</span> minimum samples <span style="color: #7590db;">+</span> 1
  
  count <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Eq</span> a <span style="color: #7590db;">=&gt;</span> a <span style="color: #7590db;">-&gt;</span> <span style="color: #4f97d7;">[</span>a<span style="color: #4f97d7;">]</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
  count x <span style="color: #7590db;">=</span> length <span style="color: #7590db;">.</span> filter <span style="color: #4f97d7;">(</span>x<span style="color: #7590db;">==</span><span style="color: #4f97d7;">)</span>
  
  
  main <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">IO</span> <span style="color: #4f97d7; font-weight: bold;">()</span>
  main <span style="color: #7590db;">=</span> return <span style="color: #4f97d7; font-weight: bold;">()</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited . Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
